---
kind: property
id: P:Autodesk.Revit.DB.ExportPatternTable.Count
source: html/1a9439b4-d23d-6d6d-6ff2-999ffc8952a9.htm
---
# Autodesk.Revit.DB.ExportPatternTable.Count Property

Count of the items contained in the collection.

## Syntax (C#)
```csharp
public int Count { get; }
```